RAFHA2413/Control_Navegacion_USV_STM32H562VGT6_v03/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

#include "servos.h"
#include "UARTRX.h"
#include <stdio.h>
#include "imu_bno085_i2c.h"
#include "TELEMETRIA_USV.h"
#include <math.h>
#include "stm32h5xx_hal_gpio.h"
#include "string.h"
#include "stdlib.h"
#include "uart.h"


#include "gps.h"

#include "stdio.h"
#include "stdlib.h"
#include "stdint.h"


/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;

DMA_HandleTypeDef handle_GPDMA1_Channel1;

I2C_HandleTypeDef hi2c1;

TIM_HandleTypeDef htim3;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;
UART_HandleTypeDef huart3;
UART_HandleTypeDef huart6;
DMA_HandleTypeDef handle_GPDMA1_Channel0;

/* USER CODE BEGIN PV */
char texto[600];


volatile uint8_t imu_ok = 0U;
volatile uint8_t imu_addr = 0U;
volatile uint8_t imu_data_ok = 0U;

float imu_roll = 0.0f;
float imu_pitch = 0.0f;
float imu_yaw = 0.0f;

uint32_t imu_last_ms = 0U;
uint32_t teleplot_last_ms = 0U;
char teleplot_tx[240];
uint8_t imu_raw[23];

int16_t imu_qi_raw = 0;
int16_t imu_qj_raw = 0;
int16_t imu_qk_raw = 0;
int16_t imu_qr_raw = 0;

volatile uint8_t imu_raw_ok = 0U;
volatile uint8_t imu_raw_channel = 0U;
volatile uint8_t imu_raw_report = 0U;
volatile uint16_t imu_raw_length = 0U;

/*
 * Diagnostico visual del enlace ESTACION -> BOTE.
 *
 * Mientras lleguen tramas por USART1, PB2 conmuta cada 250 ms.
 * Si pasan mas de 400 ms sin recibir nada, se detiene el parpadeo.
 */
uint32_t led_rx_ultimo_evento_ms = 0U;
uint32_t led_rx_ultimo_toggle_ms = 0U;
uint8_t led_rx_activo = 0U;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MPU_Config(void);
static void MX_GPIO_Init(void);
static void MX_GPDMA1_Init(void);
static void MX_ICACHE_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_USART6_UART_Init(void);
static void MX_I2C1_Init(void);
static void MX_TIM3_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_ADC1_Init(void);
/* USER CODE BEGIN PFP */
void procesa_rx(void);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/*
 * Convierte los angulos reales del BNO085 al formato exigido por $PUSVD.
 *
 * - yaw:   0.0 ... 359.9 grados, almacenado x10.
 * - pitch: -90.0 ... +90.0 grados, almacenado x10.
 * - roll:  -90.0 ... +90.0 grados, almacenado x10.
 *
 * El BNO085 puede entregar roll fuera de +/-90 dependiendo de la orientacion.
 * La Trama Version 3 no admite ese rango, por eso se satura antes de enviarlo.
 */
static void USV_ActualizarTelemetriaIMU(
        float roll,
        float pitch,
        float yaw)
{
    int32_t yaw_x10;
    int32_t pitch_x10;
    int32_t roll_x10;

    while (yaw < 0.0f)
    {
        yaw += 360.0f;
    }

    while (yaw >= 360.0f)
    {
        yaw -= 360.0f;
    }

    if (pitch < -90.0f)
    {
        pitch = -90.0f;
    }
    else if (pitch > 90.0f)
    {
        pitch = 90.0f;
    }

    if (roll < -90.0f)
    {
        roll = -90.0f;
    }
    else if (roll > 90.0f)
    {
        roll = 90.0f;
    }

    yaw_x10 =
        (int32_t)((yaw * 10.0f) + 0.5f);

    pitch_x10 =
        (int32_t)((pitch >= 0.0f) ?
            ((pitch * 10.0f) + 0.5f) :
            ((pitch * 10.0f) - 0.5f));

    roll_x10 =
        (int32_t)((roll >= 0.0f) ?
            ((roll * 10.0f) + 0.5f) :
            ((roll * 10.0f) - 0.5f));

    if (yaw_x10 > 3599)
    {
        yaw_x10 = 3599;
    }

    TELEMETRIA_USV_IMU(
        &TELEMETRIA1,
        (uint16_t)yaw_x10,
        (int16_t)pitch_x10,
        (int16_t)roll_x10);
}
/* void procesa_rx()
 {
  char procesa[100];
    char texto[100];
if (strstr(UARTRX1.trama_rx,"$PUSVU"))
	    {
	        strcpy(procesa, strtok(UARTRX1.trama_rx, "$"));  //inicia captura de tokens desde el =
	        strcpy(procesa, strtok(0, ","));  //captura hasta el /
strcpy(procesa, strtok(0, ","));  //captura hasta el /
strcpy(procesa, strtok(0, ","));  //captura hasta el /
strcpy(procesa, strtok(0, ","));  //captura hasta el /
strcpy(procesa, strtok(0, ","));  //captura hasta el /
strcpy(procesa, strtok(0, ","));  //captura hasta el /
 float serv=atof(procesa); // con signo
 sprintf(texto, "Servo= %.2f\r\n\r\n", serv);
 uartx_write_text(&huart1, texto);

 } 
  } */
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* MPU Configuration--------------------------------------------------------*/
  MPU_Config();

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

